{
  "sodium.option_impact.low": "Низкое",
  "sodium.option_impact.medium": "Среднее",
  "sodium.option_impact.high": "Высокое",
  "sodium.option_impact.extreme": "Экстремальное",
  "sodium.option_impact.varies": "Различное",
  "sodium.options.pages.quality": "Качество",
  "sodium.options.pages.performance": "Производительность",
  "sodium.options.pages.advanced": "Расширенные",
  "sodium.options.view_distance.tooltip": "Расстояние отрисовки определяет, насколько далеко будет отображаться местность. Более маленькое значение означают, что будет отображаться меньше рельефа местности, что повышает FPS.",
  "sodium.options.simulation_distance.tooltip": "Расстояние моделирования определяет, насколько удаленная местность и объекты (Такие как Дым, блоки, мобы) будут загружены и отмечены галочками. Более короткое расстояние может снизить нагрузку на внутренний сервер и повысить FPS.",
  "sodium.options.brightness.tooltip": "Управляет яркостью (гаммой) игры.",
  "sodium.options.gui_scale.tooltip": "Задает максимальный масштаб интерфейса, используемый для пользовательского интерфейса. Если используется 'авто', то всегда будет использоваться наибольший масштаб.",
  "sodium.options.fullscreen.tooltip": "Если включено, игра будет отображаться в полноэкранном режиме (Если поддерживается).",
  "sodium.options.v_sync.tooltip": "Если эта функция включена, частота кадров игры будет синхронизирована с частотой обновления монитора, что в целом обеспечивает более плавный игровой процесс за счет общей задержки ввода. Этот параметр может снизить производительность, если ваша система не достаточно мощная.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может помочь снизить расход батареи ноутбука и общую нагрузку на систему при многозадачности. Если включена функция VSync, эта опция будет игнорироваться, если только она не ниже частоты обновления вашего дисплея.",
  "sodium.options.view_bobbing.tooltip": "Если включено, камера игрока будет покачиваться при перемещении. Игроки, которые испытывают морскую болезнь во время игры, могут отключить эту функцию.",
  "sodium.options.attack_indicator.tooltip": "Управляет отображением индикатора атаки на экране.",
  "sodium.options.autosave_indicator.tooltip": "Если параметр включен, то при сохранении мира на диск будет отображаться индикатор.",
  "sodium.options.graphics_quality.tooltip": "Качество графики по умолчанию контролирует некоторые устаревшие параметры необходимые для совместимости с некоторыми модами. Если двум приведенным ниже параметрам оставить значение 'По умолчанию', то они будут использовать только этот параметр.",
  "sodium.options.clouds_quality.tooltip": "Контролирует качество отображаемых облаков в небе.",
  "sodium.options.weather_quality.tooltip": "Контролирует качество эффектов дождя и снега.",
  "sodium.options.leaves_quality.name": "Качество Листвы",
  "sodium.options.leaves_quality.tooltip": "Контролирует качество листьев.",
  "sodium.options.particle_quality.name": "Качество Частиц",
  "sodium.options.particle_quality.tooltip": "Управляет максимальным количеством частиц, которые появляются, когда происходит некоторое игровое событие (например: плавка в печи, взрыв динамита, падение капель дождя).",
  "sodium.options.smooth_lighting.tooltip": "Определяет, будут ли блоки иметь более плавные тени. Это немного увеличивает время, необходимое для прорисовки чанка, но не влияет на FPS.",
  "sodium.options.biome_blend.value": "%s Блок(ов)",
  "sodium.options.biome_blend.tooltip": "Управляет диапазоном смешивания цветов биомов, которые будут выбраны для генерации блоков. Более высокие значения значительно увеличивают время, необходимое для создания блоков, что приведёт к снижению качества, но повысит плавность переходов между биомами",
  "sodium.options.entity_distance.tooltip": "Определяет, на каком расстоянии сущности могут отображаться от игрока. Более высокие значения приведут к снижению FPS.",
  "sodium.options.entity_shadows.tooltip": "Если включено, основные тени будут отображаться под мобами и другими объектами.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если включено, эффект виньетки будет отображаться в поле зрения игрока. Маловероятно, что это повлияет на FPS, если только у вас нет ограничений на FPS.",
  "sodium.options.mipmap_levels.tooltip": "Управляет количеством Mipmap уровней текстур, которые будут использоваться для отрисовки блоков. Более высокие значения обеспечивают лучшую визуализацию блоков на расстоянии, но могут отрицательно сказаться на производительности многих анимированных текстур.",
  "sodium.options.use_block_face_culling.name": "Отрисовка полигонов с обратной стороны",
  "sodium.options.use_block_face_culling.tooltip": "Если включено, то будут отрисовываться только те стороны блоков, которые обращены к камере игрока. Это позволяет экономить пропускную способность памяти и время рендера на графическом процессоре. У некоторых пакетов ресурсов могут быть проблемы с этой опцией, поэтому попробуйте отключить ее, если вы видите дыры в блоках.",
  "sodium.options.use_fog_occlusion.name": "Отрисовка сквозь Туман",
  "sodium.options.use_fog_occlusion.tooltip": "Если параметр включен, фрагменты, которые полностью скрыты эффектами тумана, не будут отображаться, что помогает повысить производительность. Улучшение может быть более значительным, когда эффекты тумана сильнее (например, под водой), но в некоторых случаях это может привести к нежелательным визуальным артефактам между небом и туманом.",
  "sodium.options.use_entity_culling.name": "Оптимизация сущностей",
  "sodium.options.use_entity_culling.tooltip": "Если включено, объекты, которые, не находятся в поле зрения, будут не загружаться во время отрисовки. Это может помочь повысить производительность, избегая визуализации объектов, расположенных под землей или за стенами.",
  "sodium.options.use_particle_culling.name": "Оптимизация частиц",
  "sodium.options.use_particle_culling.tooltip": "Если включено, будут отображаться только те частицы, которые определены как видимые. Это может обеспечить значительное улучшение частоты кадров, когда поблизости находится много частиц.",
  "sodium.options.animate_only_visible_textures.name": "Анимировать Только Видимые Текстуры",
  "sodium.options.animate_only_visible_textures.tooltip": "Если включено, будут анимированы только видимые игроком текстуры. Это может значительно повысить FPS на некоторых системах, особенно если стоят более тяжелые пакетамы ресурсов. Если у вас возникли проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить эту опцию.",
  "sodium.options.cpu_render_ahead_limit.name": "CPU Предварительный рендер",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Указывает максимальное количество кадров, которые процессор будет прогружать перед отправкой на графический процессор для завершения отрисовки. Очень низкие или высокие значения могут привести к нестабильности частоты кадров. На особенно мощных процессорах можно попробовать увеличить это значение, на слабых – уменьшить.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(ов)",
  "sodium.options.allow_direct_memory_access.name": "Разрешить Прямой Доступ К Памяти",
  "sodium.options.allow_direct_memory_access.tooltip": "Если параметр включен, некоторым особо прожорливым функциям будет разрешено использовать прямой доступ к памяти для повышения производительности. Это часто значительно снижает нагрузку на процессор при рендеринге чанков и объектов, но может затруднить диагностику некоторых ошибок и сбоев. Вы должны отключить это только в том случае, если вы знаете, что вы делаете.",
  "sodium.options.enable_memory_tracing.name": "Включить трассировку памяти",
  "sodium.options.enable_memory_tracing.tooltip": "Функция отладки. Если этот параметр включен, трассировка стека будет собираться вместе с выделением памяти, чтобы улучшить диагностическую информацию при обнаружении утечек памяти.",
  "sodium.options.performance_impact_string": "Влияние на производительность: %s",
  "sodium.options.use_persistent_mapping.name": "Использовать постоянное сопоставление",
  "sodium.options.use_persistent_mapping.tooltip": "Если этот параметр включен, небольшой объем памяти будет постоянно использоваться в качестве промежуточного буфера для загрузки чанков, что поможет снизить нагрузку на ЦП и нестабильность Фреймтайма при загрузке или обновлении чанков.\n\nТребуется OpenGL 4.4 или ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Аллокаторы памяти для чанков",
  "sodium.options.chunk_memory_allocator.tooltip": "Выбирает распределитель памяти, который будет использоваться для отрисовки чанков.\n- ASYNC: самый быстрый вариант, хорошо работает с большинством современных графических драйверов.\n- SWAP: Запасной вариант для старых графических драйверов. Может значительно увеличить использование памяти.",
  "sodium.options.chunk_memory_allocator.async": "Async - Быстрый",
  "sodium.options.chunk_memory_allocator.swap": "Swap - Старый",
  "sodium.options.chunk_update_threads.name": "Потоковое обновление чанков",
  "sodium.options.chunk_update_threads.tooltip": "Указывает количество потоков, используемых для построения чанков. Использование большего количества потоков может ускорить загрузку чанков и скорость их обновления, но может негативно повлиять на FPS.",
  "sodium.options.always_defer_chunk_updates.name": "Отложенное обновление чанков",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если параметр включен, рендеринг никогда не будет ждать завершения обновления чанков, и перейдёт сразу на генерацию следующего, даже если они были приоритетенее. Это может значительно улучшить частоту кадров в некоторых сценариях, но может привести к значительному визуальному отставанию в мире.",
  "sodium.options.buttons.undo": "Отменить",
  "sodium.options.buttons.apply": "Применить",
  "sodium.options.buttons.donate": "Купите нам кофе!"
}