//Перевёл KolyaLaif. YouTube канал - https://www.youtube.com/@KolyaLaif/featured
//RuTube канал - https://rutube.ru/channel/24888631/
//На покушац (если не жалко) - https://www.donationalerts.com/r/kolyalaif
{
  "sodium.option_impact.low": "Низкое",
  "sodium.option_impact.medium": "Среднее",
  "sodium.option_impact.high": "Высокое",
  "sodium.option_impact.extreme": "Экстремальное",
  "sodium.option_impact.varies": "Варьирующиесе",
  "sodium.options.pages.quality": "Качество",
  "sodium.options.pages.performance": "Производительность",
  "sodium.options.pages.advanced": "Расширенные",
  "sodium.options.view_distance.tooltip": "Расстояние рендеринга определяет, как далеко будет отображаться местность. Более короткие расстояния означают, что будет отображаться меньше рельефа местности, что повышает частоту кадров.",
  "sodium.options.simulation_distance.tooltip": "Расстояние симуляции определяет, насколько далеко будут загружены и отмечены ландшафт и объекты. Меньшие расстояния могут снизить нагрузку на внутренний сервер и улучшить частоту кадров.",
  "sodium.options.brightness.tooltip": "Управляет яркостью (гаммой) игры.",
  "sodium.options.gui_scale.tooltip": "Устанавливает максимальный коэффициент масштабирования, который будет использоваться для пользовательского интерфейса. Если используется «авто», то всегда будет использоваться наибольший коэффициент масштабирования.",
  "sodium.options.fullscreen.tooltip": "Если включено, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "sodium.options.v_sync.tooltip": "Если этот параметр включен, частота кадров в игре будет синхронизирована с частотой обновления монитора, что обеспечит в целом более плавную работу за счет общей задержки ввода. Этот параметр может снизить производительность, если ваша система слишком медленная.",
  "sodium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может помочь снизить расход заряда аккумулятора и общую нагрузку на систему при многозадачности. Если V-Sync включен, этот параметр будет игнорироваться, если только он не ниже частоты обновления вашего дисплея.",
  "sodium.options.view_bobbing.tooltip": "Если включено, взгляд игрока будет качаться при перемещении. Игроки, которые испытывают укачивание во время игры, могут извлечь выгоду из отключения этой функции.",
  "sodium.options.attack_indicator.tooltip": "Управляет отображением индикатора атаки на экране.",
  "sodium.options.autosave_indicator.tooltip": "Если включено, будет отображаться индикатор, когда игра сохраняет мир на диск.",
  "sodium.options.graphics_quality.tooltip": "Качество графики по умолчанию контролирует некоторые устаревшие параметры и необходимо для совместимости с модами. Если для приведенных ниже параметров оставить значение «По умолчанию», они будут использовать этот параметр.",
  "sodium.options.clouds_quality.tooltip": "Управляет качеством визуализации облаков в небе.",
  "sodium.options.weather_quality.tooltip": "Управляет качеством эффектов дождя и снега.",
  "sodium.options.leaves_quality.name": "Качество листвы",
  "sodium.options.leaves_quality.tooltip": "Управляет качеством листвы.",
  "sodium.options.particle_quality.name": "Качество частиц",
  "sodium.options.particle_quality.tooltip": "Контролирует максимальное количество частиц, которые могут присутствовать на экране в любой момент времени.",
  "sodium.options.smooth_lighting.tooltip": "Определяет, будут ли блоки плавно освещены и затемнены. Это немного увеличивает количество времени, необходимое для перестроения чанка, но не влияет на частоту кадров.",
  "sodium.options.biome_blend.value": "%s блок(и)",
  "sodium.options.biome_blend.tooltip": "Управляет диапазоном биомов, которые будут выбраны для раскрашивания блоков. Более высокие значения значительно увеличивают время, необходимое для создания блоков, что снижает улучшение качества.",
  "sodium.options.entity_distance.tooltip": "Определяет, насколько далеко объекты могут отображаться от игрока. Более высокие значения увеличивают расстояние рендеринга за счет частоты кадров.",
  "sodium.options.entity_shadows.tooltip": "Если включено, базовые тени будут отображаться под мобами и другими сущностями.",
  "sodium.options.vignette.name": "Виньетка",
  "sodium.options.vignette.tooltip": "Если включено, эффект виньетки будет отображаться в поле зрения игрока. Маловероятно, что это повлияет на частоту кадров, если только вы не ограничены в скорости заполнения.",
  "sodium.options.mipmap_levels.tooltip": "Управляет количеством MIP-карт, которые будут использоваться для текстур блочной модели. Более высокие значения обеспечивают лучшую визуализацию блоков на расстоянии, но могут отрицательно сказаться на производительности многих анимированных текстур.",
  "sodium.options.use_block_face_culling.name": "Использовать отсечение граней блока",
  "sodium.options.use_block_face_culling.tooltip": "Если включено, для рендеринга будут представлены только те стороны блоков, которые обращены к камере. Это может исключить большое количество граней блока на самом раннем этапе процесса рендеринга, экономя пропускную способность памяти и время, затрачиваемое на графический процессор. Некоторые пакеты ресурсов могут иметь проблемы с этой опцией, поэтому попробуйте отключить ее, если вы видите дыры в блоках.",
  "sodium.options.use_fog_occlusion.name": "Использовать окклюзию тумана",
  "sodium.options.use_fog_occlusion.tooltip": "Если этот параметр включен, чанки, которые определены как полностью скрытые эффектами тумана, не будут отображаться, что поможет повысить производительность. Улучшение может быть более значительным, когда эффекты тумана сильнее (например, под водой), но в некоторых сценариях это может вызвать нежелательные визуальные артефакты между небом и туманом.",
  "sodium.options.use_entity_culling.name": "Использовать отсечение сущностей",
  "sodium.options.use_entity_culling.tooltip": "Если этот параметр включен, объекты, которые не входят ни в какие видимые фрагменты, будут пропущены во время рендеринга. Это может помочь повысить производительность, избегая рендеринга объектов, расположенных под землей или за стенами.",
  "sodium.options.use_particle_culling.name": "Использовать отбраковку частиц",
  "sodium.options.use_particle_culling.tooltip": "Если включено, будут визуализированы только те частицы, которые определены как видимые. Это может обеспечить значительное улучшение частоты кадров, когда поблизости много частиц.",
  "sodium.options.animate_only_visible_textures.name": "Анимация только видимых текстур",
  "sodium.options.animate_only_visible_textures.tooltip": "Если этот параметр включен, будут обновлены только те анимированные текстуры, которые определены как видимые. Это может обеспечить значительное повышение частоты кадров на некоторых компьютерах, особенно с более тяжелыми пакетами ресурсов. Если у вас возникли проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить эту опцию.",
  "sodium.options.cpu_render_ahead_limit.name": "Ограничение на опережающий рендеринг процессора",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Указывает максимальное количество кадров, которые центральный процессор может ожидать от графического процессора для завершения рендеринга. Очень низкие или высокие значения могут привести к нестабильности частоты кадров.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(ы)",
  "sodium.options.allow_direct_memory_access.name": "Разрешить прямой доступ к памяти",
  "sodium.options.allow_direct_memory_access.tooltip": "Если этот параметр включен, некоторым критически важным путям кода будет разрешено использовать прямой доступ к памяти для повышения производительности. Это часто значительно снижает нагрузку на процессор при рендеринге фрагменто и сущностей, но может затруднить диагностику некоторых ошибок и сбоев. Вы должны отключить это только в том случае, если вас об этом попросили или вы иным образом знаете, что делаете.",
  "sodium.options.enable_memory_tracing.name": "Включить отслеживание памяти",
  "sodium.options.enable_memory_tracing.tooltip": "Функция отладки. Если включено, трассировки стека будут собираться вместе с выделением памяти, чтобы помочь улучшить диагностическую информацию при обнаружении утечек памяти.",
  "sodium.options.performance_impact_string": "Влияние на производительность: %s",
  "sodium.options.use_persistent_mapping.name": "Используйте постоянное сопоставление",
  "sodium.options.use_persistent_mapping.tooltip": "Если включено, небольшой объем памяти будет постоянно отображаться в качестве промежуточного буфера для загрузки фрагментов, что помогает снизить нагрузку на процессор и нестабильность времени кадра при загрузке или обновлении фрагментов.\n\nТребуется OpenGL 4.4 or ARB_buffer_storage.",
  "sodium.options.chunk_memory_allocator.name": "Распределитель фрагментарной памяти",
  "sodium.options.chunk_memory_allocator.tooltip": "Выбирает распределитель памяти, который будет использоваться для рендеринга фрагментов.\n- АСИНХРОННОСТЬ: Самый быстрый вариант, хорошо работает с большинством современных графических драйверов.\n- ЗАМЕНА: Запасной вариант для старых графических драйверов. Может значительно увеличить использование памяти.",
  "sodium.options.chunk_memory_allocator.async": "Асинхронность",
  "sodium.options.chunk_memory_allocator.swap": "Замена",
  "sodium.options.chunk_update_threads.name": "Потоки обновления чанков",
  "sodium.options.chunk_update_threads.tooltip": "Указывает количество потоков, используемых для построения блоков. Использование большего количества потоков может ускорить загрузку фрагментов и скорость обновления, но может негативно повлиять на время обработки кадров.",
  "sodium.options.always_defer_chunk_updates.name": "Всегда откладывать обновления чанков",
  "sodium.options.always_defer_chunk_updates.tooltip": "Если включено, рендеринг никогда не будет дожидаться завершения обновлений чанков, даже если они важны. Это может значительно улучшить частоту кадров в некоторых сценариях, но может привести к значительному отставанию в визуальном восприятии окружающего мира.",
  "sodium.options.buttons.undo": "Отменить",
  "sodium.options.buttons.apply": "Применить",
  "sodium.options.buttons.donate": "Buy us a coffee!"
}